# 데이터 프레임

<img src="etc/1_dataframe.png" />

### [ pandas ]
데이터프레임 데이터 구조를 사용하려면 pandas 모듈 필요

In [ ]:
#TODO()

#### ○ 각 열 생성 (Series 생성)

In [ ]:
age      = pd.#TODO()([ 26, 42, 27, 25, 20,  20, 21, 22, 23, 25])
score    = pd.Series([3.8,4.2, 2.6,1.0,3.0,4.0, 4.2,2.2,4.1,3.8])
salary =  pd.Series([2700,4000,3000,2700,3200,1000,3000,7000,3200,3500])

#### ○ 데이터프레임 생성

In [ ]:
df = pd.#TODO() ( {'age': age,
                     'score' :  score  ,
                     'salary' : salary }
)

#### ○ 데이터 확인하기

In [ ]:
df   # 데이터 전체 확인

   age  score  salary
0   26    3.8    2700
1   42    4.2    4000
2   27    2.6    3000
3   25    1.0    2700
4   20    3.0    3200
5   20    4.0    1000
6   21    4.2    3000
7   22    2.2    7000
8   23    4.1    3200
9   25    3.8    3500

In [ ]:
df.#TODO    # 데이터 앞 5행만 확인

   age  score  salary
0   26    3.8    2700
1   42    4.2    4000
2   27    2.6    3000
3   25    1.0    2700
4   20    3.0    3200

In [ ]:
df.#TODO    # 데이터 앞 3행만 확인

   age  score  salary
0   26    3.8    2700
1   42    4.2    4000
2   27    2.6    3000

In [ ]:
df.#TODO   # 데이터 뒤 5행만 확인

   age  score  salary
5   20    4.0    1000
6   21    4.2    3000
7   22    2.2    7000
8   23    4.1    3200
9   25    3.8    3500

In [ ]:
df.#TODO   # 데이터 뒤 3행만 확인

   age  score  salary
7   22    2.2    7000
8   23    4.1    3200
9   25    3.8    3500

In [ ]:
df

   age  score  salary
0   26    3.8    2700
1   42    4.2    4000
2   27    2.6    3000
3   25    1.0    2700
4   20    3.0    3200
5   20    4.0    1000
6   21    4.2    3000
7   22    2.2    7000
8   23    4.1    3200
9   25    3.8    3500

In [ ]:
# 행 인덱스 확인
df.#TODO

RangeIndex(start=0, stop=10, step=1)

In [ ]:
# 열 이름 확인
df.#TODO

Index(['age', 'score', 'salary'], dtype='object')

In [ ]:
# 값만 확인
df.values

array([[2.6e+01, 3.8e+00, 2.7e+03],
       [4.2e+01, 4.2e+00, 4.0e+03],
       [2.7e+01, 2.6e+00, 3.0e+03],
       [2.5e+01, 1.0e+00, 2.7e+03],
       [2.0e+01, 3.0e+00, 3.2e+03],
       [2.0e+01, 4.0e+00, 1.0e+03],
       [2.1e+01, 4.2e+00, 3.0e+03],
       [2.2e+01, 2.2e+00, 7.0e+03],
       [2.3e+01, 4.1e+00, 3.2e+03],
       [2.5e+01, 3.8e+00, 3.5e+03]])

In [ ]:
# 요약 정보 확인
df.#TODO()

             age      score       salary
count  10.000000  10.000000    10.000000
mean   25.100000   3.290000  3330.000000
std     6.436873   1.071292  1506.320019
min    20.000000   1.000000  1000.000000
25%    21.250000   2.700000  2775.000000
50%    24.000000   3.800000  3100.000000
75%    25.750000   4.075000  3425.000000
max    42.000000   4.200000  7000.000000

In [ ]:
# 데이터를 전치한다.
df.T

,0,1,2,3,4,5,6,7,8,9
age,26.0,42.0,27.0,25.0,20.0,20.0,21.0,22.0,23.0,25.0
score,3.8,4.2,2.6,1.0,3.0,4.0,4.2,2.2,4.1,3.8
salary,2700.0,4000.0,3000.0,2700.0,3200.0,1000.0,3000.0,7000.0,3200.0,3500.0

In [ ]:
df.#TODO  # 점수 기준 오름 차순 정렬

   age  score  salary
3   25    1.0    2700
7   22    2.2    7000
2   27    2.6    3000
4   20    3.0    3200
0   26    3.8    2700
9   25    3.8    3500
5   20    4.0    1000
8   23    4.1    3200
1   42    4.2    4000
6   21    4.2    3000

In [ ]:
df.sort_values(by='score', #TODO ) # 점수 기준 내림 차순 정렬

   age  score  salary
1   42    4.2    4000
6   21    4.2    3000
8   23    4.1    3200
5   20    4.0    1000
0   26    3.8    2700
9   25    3.8    3500
4   20    3.0    3200
2   27    2.6    3000
7   22    2.2    7000
3   25    1.0    2700

In [ ]:
df.#TODO()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
age       10 non-null int64
score     10 non-null float64
salary    10 non-null int64
dtypes: float64(1), int64(2)
memory usage: 320.0 bytes

#### ○ 데이터프레임 열 추가

In [ ]:
#TODO = pd.Series([ 1, 1, 2, 2, 2, 3, 3,4, 4, 4])
# class 열이 존재하면 갱신, 없으면 추가
df.head()

   age  score  salary  class
0   26    3.8    2700      1
1   42    4.2    4000      1
2   27    2.6    3000      2
3   25    1.0    2700      2
4   20    3.0    3200      2

#### ○ 데이터프레임 열 삭제

In [ ]:
help(pd.DataFrame.drop)  # DataFrame 함수 도움말 보기

Help on function drop in module pandas.core.frame:

drop(self, labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise')
    Drop specified labels from rows or columns.

    Remove rows or columns by specifying label names and corresponding
    axis, or by specifying directly index or column names. When using a
    multi-index, labels on different levels can be removed by specifying
    the level.

    Parameters
    ----------
    labels : single label or list-like
        Index or column labels to drop.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Whether to drop labels from the index (0 or 'index') or
        columns (1 or 'columns').
    index, columns : single label or list-like
        Alternative to specifying axis (``labels, axis=1``
        is equivalent to ``columns=labels``).

        .. versionadded:: 0.21.0
    level : int or level name, optional
        For MultiIndex, level from which the labels will be removed.
    inplace : bool, default False
        If True, do operation inplace and return None.
    errors : {'ignore', 'raise'}, default 'raise'
        If 'ignore', suppress error and only existing labels are
        dropped.

    Returns
    -------
    dropped : pandas.DataFrame

    Raises
    ------
    KeyError
        If none of the labels are found in the selected axis

    See Also
    --------
    DataFrame.loc : Label-location based indexer for selection by label.
    DataFrame.dropna : Return DataFrame with labels on given axis omitted
        where (all or any) data are missing.
    DataFrame.drop_duplicates : Return DataFrame with duplicate rows
        removed, optionally only considering certain columns.
    Series.drop : Return Series with specified index labels removed.

    Examples
    --------
    >>> df = pd.DataFrame(np.arange(12).reshape(3,4),
    ...                   columns=['A', 'B', 'C', 'D'])
    >>> df
       A  B   C   D
    0  0  1   2   3
    1  4  5   6   7
    2  8  9  10  11

    Drop columns

    >>> df.drop(['B', 'C'], axis=1)
       A   D
    0  0   3
    1  4   7
    2  8  11

    >>> df.drop(columns=['B', 'C'])
       A   D
    0  0   3
    1  4   7
    2  8  11

    Drop a row by index

    >>> df.drop([0, 1])
       A  B   C   D
    2  8  9  10  11

    Drop columns and/or rows of MultiIndex DataFrame

    >>> midx = pd.MultiIndex(levels=[['lama', 'cow', 'falcon'],
    ...                              ['speed', 'weight', 'length']],
    ...                      codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
    ...                             [0, 1, 2, 0, 1, 2, 0, 1, 2]])
    >>> df = pd.DataFrame(index=midx, columns=['big', 'small'],
    ...                   data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
    ...                         [250, 150], [1.5, 0.8], [320, 250],
    ...                         [1, 0.8], [0.3,0.2]])
    >>> df
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            weight  1.0     0.8
            length  0.3     0.2

    >>> df.drop(index='cow', columns='small')
                    big
    lama    speed   45.0
            weight  200.0
            length  1.5
    falcon  speed   320.0
            weight  1.0
            length  0.3

    >>> df.drop(index='length', level=1)
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
    falcon  speed   320.0   250.0
            weight  1.0     0.8

In [ ]:
df.#TODO (#TODO=['class'])
# class 컬럼이 삭제된 새로운 데이터프레임을 생성해서 반환. df 자체는 변하지 않음

   age  score  salary
0   26    3.8    2700
1   42    4.2    4000
2   27    2.6    3000
3   25    1.0    2700
4   20    3.0    3200
5   20    4.0    1000
6   21    4.2    3000
7   22    2.2    7000
8   23    4.1    3200
9   25    3.8    3500

In [ ]:
#TODO

   age  score  salary  class
0   26    3.8    2700      1
1   42    4.2    4000      1
2   27    2.6    3000      2
3   25    1.0    2700      2
4   20    3.0    3200      2
5   20    4.0    1000      3
6   21    4.2    3000      3
7   22    2.2    7000      4
8   23    4.1    3200      4
9   25    3.8    3500      4

In [ ]:
df.drop(columns=['class'], #TODO)
# df 자체는 변함.  df의 'class' 컬럼 삭제됨.

In [ ]:
df

   age  score  salary
0   26    3.8    2700
1   42    4.2    4000
2   27    2.6    3000
3   25    1.0    2700
4   20    3.0    3200
5   20    4.0    1000
6   21    4.2    3000
7   22    2.2    7000
8   23    4.1    3200
9   25    3.8    3500

#### ○ 데이터프레임 행 삭제

In [ ]:
df.drop(#TODO , axis=0 )
# 행 인덱스 0,1인 행을 삭제하여 새로운 데이터프레임을 생성해서 반환.
# df자체는 변하지 않음

   age  score  salary
2   27    2.6    3000
3   25    1.0    2700
4   20    3.0    3200
5   20    4.0    1000
6   21    4.2    3000
7   22    2.2    7000
8   23    4.1    3200
9   25    3.8    3500

In [ ]:
df.drop(labels=[0,1], axis=0 , #TODO)
# df 자체는 변함.  df의 행 인덱스 0,1인 행을 삭제

In [ ]:
df

   age  score  salary
2   27    2.6    3000
3   25    1.0    2700
4   20    3.0    3200
5   20    4.0    1000
6   21    4.2    3000
7   22    2.2    7000
8   23    4.1    3200
9   25    3.8    3500

#### ○ 범주형 열 데이터

In [ ]:
age      = pd.Series([ 26, 42, 27, 25, 20,  20, 21, 22, 23, 25]  )
score    = pd.Series([3.8,4.2, 2.6,1.0,3.0,4.0, 4.2,2.2,4.1,3.8] )
salary =  pd.Series([2700,4000,3000,2700,3200,1000,3000,7000,3200,3500])

# 범주형 변수 생성
stu_class = pd.#TODO([ 1, 1, 2, 2, 2, 3, 3,4, 4, 4])
gender    = pd.#TODO([ 'F', 'M', 'M', 'M', 'M', 'F', 'F','F', 'M', 'M'])

In [ ]:
df = pd.DataFrame ( {'age': age,
                     'score' :  score  ,
                     'salary' : salary,
                      'class' :stu_class,
                       'gender' : gender}
)
df

   age  score  salary class gender
0   26    3.8    2700     1      F
1   42    4.2    4000     1      M
2   27    2.6    3000     2      M
3   25    1.0    2700     2      M
4   20    3.0    3200     2      M
5   20    4.0    1000     3      F
6   21    4.2    3000     3      F
7   22    2.2    7000     4      F
8   23    4.1    3200     4      M
9   25    3.8    3500     4      M

#### ○ 일부 데이터를 추출

일부 열만 추출

In [ ]:
# 단일 열 추출
# Series 타입으로 추출
#TODO  # 또는 df.score

0    3.8
1    4.2
2    2.6
3    1.0
4    3.0
5    4.0
6    4.2
7    2.2
8    4.1
9    3.8
Name: score, dtype: float64

In [ ]:
#  복수 열 추출
df.#TODO[:, ('class', 'score')]

  class  score
0     1    3.8
1     1    4.2
2     2    2.6
3     2    1.0
4     2    3.0
5     3    4.0
6     3    4.2
7     4    2.2
8     4    4.1
9     4    3.8

일부 행만 추출

In [ ]:
#TODO

   age  score  salary class gender
0   26    3.8    2700     1      F
1   42    4.2    4000     1      M
2   27    2.6    3000     2      M

행과 열 제한 (by label)

In [ ]:
df.#TODO[#TODO ,('class', 'score')]  # 데이터 프레임으로 반환

  class  score
0     1    3.8
1     1    4.2
2     2    2.6
3     2    1.0

In [ ]:
df.loc[3,'class']  # # 하나의 값(스칼라)만 반환

2

행과 열 제한 (by 위치)

In [ ]:
df.#TODO[0:3]       # 0~2 행,  모든 열

   age  score  salary class gender
0   26    3.8    2700     1      F
1   42    4.2    4000     1      M
2   27    2.6    3000     2      M

In [ ]:
df.#TODO[0:3 , : ]   # 0~2 행,  모든 열

   age  score  salary class gender
0   26    3.8    2700     1      F
1   42    4.2    4000     1      M
2   27    2.6    3000     2      M

In [ ]:
df.iloc[0:3 ,2:5]   # 0~2 행,  2~4 행

   salary class gender
0    2700     1      F
1    4000     1      M
2    3000     2      M

In [ ]:
df.iloc[: ,2:5]     # 모든 행,  2~4 행

   salary class gender
0    2700     1      F
1    4000     1      M
2    3000     2      M
3    2700     2      M
4    3200     2      M
5    1000     3      F
6    3000     3      F
7    7000     4      F
8    3200     4      M
9    3500     4      M

In [ ]:
df.iloc[[1,2,4],[0,2]] # 특정 위치.

   age  salary
1   42    4000
2   27    3000
4   20    3200

In [ ]:
df.iloc[0,0]    # 하나의 값(스칼라)만 반환

26

조건으로 추출

In [ ]:
df[ #TODO ]   # 또는 df[df["score"] > 3.0]   # score가 3.0 보다 큰 행만

   age  score  salary class gender
0   26    3.8    2700     1      F
1   42    4.2    4000     1      M
5   20    4.0    1000     3      F
6   21    4.2    3000     3      F
8   23    4.1    3200     4      M
9   25    3.8    3500     4      M

In [ ]:
df[#TODO]           # 1반 만 추출

   age  score  salary class gender
0   26    3.8    2700     1      F
1   42    4.2    4000     1      M

In [ ]:
df[ (df["class"] == 1 )| (df["class"] == 2) ]   # 1반 또는 2반 추출

   age  score  salary class gender
0   26    3.8    2700     1      F
1   42    4.2    4000     1      M
2   27    2.6    3000     2      M
3   25    1.0    2700     2      M
4   20    3.0    3200     2      M

In [ ]:
df[df["class"].#TODO ([1,2] )]  # 1반 또는 2반 추출

   age  score  salary class gender
0   26    3.8    2700     1      F
1   42    4.2    4000     1      M
2   27    2.6    3000     2      M
3   25    1.0    2700     2      M
4   20    3.0    3200     2      M

In [ ]:
df[ (#TODO  & (df.score <= 3.0)]

   age  score  salary class gender
2   27    2.6    3000     2      M
4   20    3.0    3200     2      M
7   22    2.2    7000     4      F

In [ ]:
df.loc[ (df.score >= 2.0) & (df.score <= 3.0),   #TODO]

  class  score
2     2    2.6
4     2    3.0
7     4    2.2